posts/math_self_learning/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 27 Dec. 2020 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>(Un)-Learning math</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Muhammad Hamza Ikram">
<!-- Global site tag (gtag.js) - Google Analytics -->
<link href='https://maxcdn.bootstrapcdn.com/font-awesome/4.4.0/css/font-awesome.min.css' rel='stylesheet' integrity='sha256-k2/8zcNbxVIh5mnQ52A0r3a6jAgMGxFJFE2707UxGCk= sha512-ZV9KawG2Legkwp3nAlxLIVFudTauWuBpC10uEafMHYL0Sarrz5A7G79kXh5+5+woxQ5HM559XX2UZjMJ36Wplg==' crossorigin='anonymous'/>
<meta description='The blog of Muhammad Hamza Ikram'/>
<link rel='alternate' type='application+rss/xml' title='The blog of Muhammad Hamza Ikram' href='posts/rss.xml'/>
<link rel="stylesheet" href="../../css/site.css?v=418ad1059cb5e9680531aef4d29bdea36e5f1283e05d89133ca009116a6522e8" type="text/css">
</head>
<body>
<header id="preamble" class="status">
<aside>
<div class=\"header\">
    <a href="/">{mhikram.github.io}</a>
    <a href="/posts/archive.html">blog</a>
    <a href="/ABOUTME.html">about</a>
    <a title="mhikram on Github" href="https://github.com/mhikram">
    <i class="fa fa-github-square"></i>
    </a>
    <a title="m_hamza_ikram on Twitter" href="https://twitter.com/m_hamza_ikram">
    <i class="fa fa-twitter-square"></i>
    </a>
    <!--</a>
    <a title="RSS feed" id="atom" href="posts/rss.xml">
    <i class="fa fa-rss-square"></i>
    </a>--!>
</div>
</aside>
</header>
<main id="content">
<header>
<h1 class="title">(Un)-Learning math</h1>
<p class="subtitle">Dec 19, 2020</p>
</header><section id="outline-container-org4f33402" class="outline-2">
<h2 id="org4f33402">Why am I doing this?</h2>
<div class="outline-text-2" id="text-org4f33402">
<p>
This has been inspired by a tweet thread by Dan Kaminsky.
</p>
<blockquote>
<p>
I&rsquo;m increasingly thinking that every functioning system has two forms: The abstraction that outsiders are led to believe, and the reality that insiders actually and carefully operate.You don&rsquo;t incrementally learn a system. You eventually unlearn its necessary lies. &#x2013; <a href="https://twitter.com/dakami/status/953444486209716225">Dan Kaminsky (@dakami)</a>
</p>
</blockquote>

<p>
Dan&rsquo;s insight made me realize that while I&rsquo;ve always had a severe case of the imposter syndrome, I&rsquo;ve never been close enough or knew enough about something to see it for the sham that it (supposedly) is. That made me think about everything that might have prevented me from seeing through the abstraction.
</p>
</div>
</section>
<section id="outline-container-orgf47f615" class="outline-2">
<h2 id="orgf47f615">What will I be doing?</h2>
<div class="outline-text-2" id="text-orgf47f615">
<p>
Documenting my journey to unlearn and relearn math. Starting from first principles. I don&rsquo;t know where the journey is going to take me, but I&rsquo;ll be taking decision on what areas to focus on along the way.
</p>

<p>
The following is the chronological list of books/resources I&rsquo;ll be working through:
</p>
<ul class="org-ul">
<li>(<span class="timestamp-wrapper"><span class="timestamp">04 Dec 2020</span></span> - ) <a href="https://www.amazon.com/Foundations-Mathematics-Ian-Stewart/dp/019870643X">The Foundations of Mathematics 2nd Edition by Ian Stewart</a> <a href="https://github.com/mhikram/foundaition_of_math_2nd_edition">(Solutions)</a></li>
</ul>
</div>
</section>

<section id="outline-container-orge3545d3" class="outline-2">
<h2 id="orge3545d3">How will I be doing it?</h2>
<div class="outline-text-2" id="text-orge3545d3">
<p>
I&rsquo;ll be enforcing a hard limit of finishing either all odd or even numbered exercises for one chapter for each book that I&rsquo;m working through. Along the way I might take random digressions to add more detail where necessary, but the plan is to focus on foundational texts and gain deeper insight.
</p>
</div>
</section>
</main>
<footer id="postamble" class="status">
<p class='disclaimer'>The postings on this site are my own and don't necessarily represent my employer’s positions, strategies or opinions.</p>

<p>Last updated 19 Dec. 2020. Built with <a href="https://www.gnu.org/software/emacs/">Emacs</a> 27.1 (<a href="https://orgmode.org">Org</a> mode 9.4). <a href="/README.html">Details</a>.</p>
</footer>
</body>
</html>
